###################################################################

# Created by write_sdc on Wed Jun  5 16:56:58 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max WCCOM -max_library                               \
fsa0m_a_generic_core_ss1p62v125c\
                         -min BCCOM -min_library                               \
fsa0m_a_generic_core_ff1p98vm40c
set_wire_load_model -name G200K -library fsa0m_a_generic_core_tt1p8v25c
set_max_fanout 6 [current_design]
set_max_area 0
set_load -pin_load 10 [get_ports {o_pconv[24]}]
set_load -pin_load 10 [get_ports {o_pconv[23]}]
set_load -pin_load 10 [get_ports {o_pconv[22]}]
set_load -pin_load 10 [get_ports {o_pconv[21]}]
set_load -pin_load 10 [get_ports {o_pconv[20]}]
set_load -pin_load 10 [get_ports {o_pconv[19]}]
set_load -pin_load 10 [get_ports {o_pconv[18]}]
set_load -pin_load 10 [get_ports {o_pconv[17]}]
set_load -pin_load 10 [get_ports {o_pconv[16]}]
set_load -pin_load 10 [get_ports {o_pconv[15]}]
set_load -pin_load 10 [get_ports {o_pconv[14]}]
set_load -pin_load 10 [get_ports {o_pconv[13]}]
set_load -pin_load 10 [get_ports {o_pconv[12]}]
set_load -pin_load 10 [get_ports {o_pconv[11]}]
set_load -pin_load 10 [get_ports {o_pconv[10]}]
set_load -pin_load 10 [get_ports {o_pconv[9]}]
set_load -pin_load 10 [get_ports {o_pconv[8]}]
set_load -pin_load 10 [get_ports {o_pconv[7]}]
set_load -pin_load 10 [get_ports {o_pconv[6]}]
set_load -pin_load 10 [get_ports {o_pconv[5]}]
set_load -pin_load 10 [get_ports {o_pconv[4]}]
set_load -pin_load 10 [get_ports {o_pconv[3]}]
set_load -pin_load 10 [get_ports {o_pconv[2]}]
set_load -pin_load 10 [get_ports {o_pconv[1]}]
set_load -pin_load 10 [get_ports {o_pconv[0]}]
create_clock [get_ports clk]  -period 1  -waveform {0 0.5}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  -max 1  [get_ports clk]
set_input_delay -clock clk  -max 1  [get_ports rst_n]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[23]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[22]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[21]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[20]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[19]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[18]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[17]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[16]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[15]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[14]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[13]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[12]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[11]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[10]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[9]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[8]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[7]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[6]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[5]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[4]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[3]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[2]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[1]}]
set_input_delay -clock clk  -max 1  [get_ports {i_weight[0]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[47]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[46]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[45]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[44]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[43]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[42]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[41]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[40]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[39]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[38]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[37]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[36]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[35]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[34]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[33]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[32]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[31]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[30]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[29]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[28]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[27]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[26]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[25]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[24]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[23]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[22]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[21]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[20]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[19]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[18]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[17]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[16]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[15]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[14]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[13]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[12]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[11]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[10]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[9]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[8]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[7]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[6]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[5]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[4]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[3]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[2]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[1]}]
set_input_delay -clock clk  -max 1  [get_ports {i_data[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {o_pconv[0]}]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports rst_n]
set_drive 1  [get_ports {i_weight[23]}]
set_drive 1  [get_ports {i_weight[22]}]
set_drive 1  [get_ports {i_weight[21]}]
set_drive 1  [get_ports {i_weight[20]}]
set_drive 1  [get_ports {i_weight[19]}]
set_drive 1  [get_ports {i_weight[18]}]
set_drive 1  [get_ports {i_weight[17]}]
set_drive 1  [get_ports {i_weight[16]}]
set_drive 1  [get_ports {i_weight[15]}]
set_drive 1  [get_ports {i_weight[14]}]
set_drive 1  [get_ports {i_weight[13]}]
set_drive 1  [get_ports {i_weight[12]}]
set_drive 1  [get_ports {i_weight[11]}]
set_drive 1  [get_ports {i_weight[10]}]
set_drive 1  [get_ports {i_weight[9]}]
set_drive 1  [get_ports {i_weight[8]}]
set_drive 1  [get_ports {i_weight[7]}]
set_drive 1  [get_ports {i_weight[6]}]
set_drive 1  [get_ports {i_weight[5]}]
set_drive 1  [get_ports {i_weight[4]}]
set_drive 1  [get_ports {i_weight[3]}]
set_drive 1  [get_ports {i_weight[2]}]
set_drive 1  [get_ports {i_weight[1]}]
set_drive 1  [get_ports {i_weight[0]}]
set_drive 1  [get_ports {i_data[47]}]
set_drive 1  [get_ports {i_data[46]}]
set_drive 1  [get_ports {i_data[45]}]
set_drive 1  [get_ports {i_data[44]}]
set_drive 1  [get_ports {i_data[43]}]
set_drive 1  [get_ports {i_data[42]}]
set_drive 1  [get_ports {i_data[41]}]
set_drive 1  [get_ports {i_data[40]}]
set_drive 1  [get_ports {i_data[39]}]
set_drive 1  [get_ports {i_data[38]}]
set_drive 1  [get_ports {i_data[37]}]
set_drive 1  [get_ports {i_data[36]}]
set_drive 1  [get_ports {i_data[35]}]
set_drive 1  [get_ports {i_data[34]}]
set_drive 1  [get_ports {i_data[33]}]
set_drive 1  [get_ports {i_data[32]}]
set_drive 1  [get_ports {i_data[31]}]
set_drive 1  [get_ports {i_data[30]}]
set_drive 1  [get_ports {i_data[29]}]
set_drive 1  [get_ports {i_data[28]}]
set_drive 1  [get_ports {i_data[27]}]
set_drive 1  [get_ports {i_data[26]}]
set_drive 1  [get_ports {i_data[25]}]
set_drive 1  [get_ports {i_data[24]}]
set_drive 1  [get_ports {i_data[23]}]
set_drive 1  [get_ports {i_data[22]}]
set_drive 1  [get_ports {i_data[21]}]
set_drive 1  [get_ports {i_data[20]}]
set_drive 1  [get_ports {i_data[19]}]
set_drive 1  [get_ports {i_data[18]}]
set_drive 1  [get_ports {i_data[17]}]
set_drive 1  [get_ports {i_data[16]}]
set_drive 1  [get_ports {i_data[15]}]
set_drive 1  [get_ports {i_data[14]}]
set_drive 1  [get_ports {i_data[13]}]
set_drive 1  [get_ports {i_data[12]}]
set_drive 1  [get_ports {i_data[11]}]
set_drive 1  [get_ports {i_data[10]}]
set_drive 1  [get_ports {i_data[9]}]
set_drive 1  [get_ports {i_data[8]}]
set_drive 1  [get_ports {i_data[7]}]
set_drive 1  [get_ports {i_data[6]}]
set_drive 1  [get_ports {i_data[5]}]
set_drive 1  [get_ports {i_data[4]}]
set_drive 1  [get_ports {i_data[3]}]
set_drive 1  [get_ports {i_data[2]}]
set_drive 1  [get_ports {i_data[1]}]
set_drive 1  [get_ports {i_data[0]}]
