###############################################################
#  Generated by:      Cadence Innovus 21.13-s100_1
#  OS:                Linux x86_64(Host ID cad16)
#  Generated on:      Tue Jun  4 00:06:55 2024
#  Design:            CHIP
#  Command:           routeDesign -globalDetail -viaOpt -wireOpt
###############################################################
current_design CHIP
create_clock [get_ports {clk}]  -name clk -period 4.000000 -waveform {0.000000 2.000000}
set_propagated_clock  [get_ports {clk}]
set_drive 1  [get_ports {clk}]
set_drive 1  [get_ports {rst_n}]
set_drive 1  [get_ports {layer_num[1]}]
set_drive 1  [get_ports {layer_num[0]}]
set_drive 1  [get_ports {i_data[7]}]
set_drive 1  [get_ports {i_data[6]}]
set_drive 1  [get_ports {i_data[5]}]
set_drive 1  [get_ports {i_data[4]}]
set_drive 1  [get_ports {i_data[3]}]
set_drive 1  [get_ports {i_data[2]}]
set_drive 1  [get_ports {i_data[1]}]
set_drive 1  [get_ports {i_data[0]}]
set_load -pin_load -max  10  [get_ports {o_data[14]}]
set_load -pin_load -min  10  [get_ports {o_data[14]}]
set_load -pin_load -max  10  [get_ports {o_data[13]}]
set_load -pin_load -min  10  [get_ports {o_data[13]}]
set_load -pin_load -max  10  [get_ports {o_data[12]}]
set_load -pin_load -min  10  [get_ports {o_data[12]}]
set_load -pin_load -max  10  [get_ports {o_data[11]}]
set_load -pin_load -min  10  [get_ports {o_data[11]}]
set_load -pin_load -max  10  [get_ports {o_data[10]}]
set_load -pin_load -min  10  [get_ports {o_data[10]}]
set_load -pin_load -max  10  [get_ports {o_data[9]}]
set_load -pin_load -min  10  [get_ports {o_data[9]}]
set_load -pin_load -max  10  [get_ports {o_data[8]}]
set_load -pin_load -min  10  [get_ports {o_data[8]}]
set_load -pin_load -max  10  [get_ports {o_data[7]}]
set_load -pin_load -min  10  [get_ports {o_data[7]}]
set_load -pin_load -max  10  [get_ports {o_data[6]}]
set_load -pin_load -min  10  [get_ports {o_data[6]}]
set_load -pin_load -max  10  [get_ports {o_data[5]}]
set_load -pin_load -min  10  [get_ports {o_data[5]}]
set_load -pin_load -max  10  [get_ports {o_data[4]}]
set_load -pin_load -min  10  [get_ports {o_data[4]}]
set_load -pin_load -max  10  [get_ports {o_data[3]}]
set_load -pin_load -min  10  [get_ports {o_data[3]}]
set_load -pin_load -max  10  [get_ports {o_data[2]}]
set_load -pin_load -min  10  [get_ports {o_data[2]}]
set_load -pin_load -max  10  [get_ports {o_data[1]}]
set_load -pin_load -min  10  [get_ports {o_data[1]}]
set_load -pin_load -max  10  [get_ports {o_data[0]}]
set_load -pin_load -min  10  [get_ports {o_data[0]}]
set_max_fanout 6  [get_designs {CHIP}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {i_data[6]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {layer_num[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {i_data[4]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {i_data[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {i_data[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {i_data[7]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {layer_num[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {i_data[5]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {i_data[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {i_data[1]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[14]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[12]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[9]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[10]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[7]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[5]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[3]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[1]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[13]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[11]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[8]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[6]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[4]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[2]}]
set_output_delay -add_delay 0.5 -min -clock [get_clocks {clk}] [get_ports {o_data[0]}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
